
%% 导入配色文件
mycolor =[0.956862745098039,0.533333333333333,0.415686274509804;...
    0.501960784313726,0.635294117647059,0.752941176470588];

x = 0:1:12;
y1 = [0, 11791, 79824, 81554, 82549, 82692, 83209, 84012, 84733, 84814, 85397, 85942, 86471];
y2 = [0, 259, 2870, 3312, 3343, 3344, 3344, 3344, 3344, 3344, 3344, 3344, 3344];


%% 开始绘图 所用函数为area
figure('color',[ 1 1 1]);

% 参数设置主要为线宽、面积颜色、阴影系数
area(x, y1,'Linewidth', 1,'FaceColor',mycolor(1,:),'EdgeColor',mycolor(1,:),'FaceAlpha',0.4);
hold on;

area(x, y2,'Linewidth', 1,'FaceColor',mycolor(2,:),'EdgeColor',mycolor(2,:),'FaceAlpha',0.4);
hold on;

%% 添加图例与轴标题
xlabel('月份');
ylabel('累计人数');
title('图4: 2020 年中国新冠累计感染及死亡人数堆积面积图');
legend('新冠累计感染人数','新冠累计死亡人数');